# EDA：欄位的資料類型介紹及處理 - 作業程式碼

本次作業需要完成兩個部分：
- Part1. 請按照下方程式碼提示，建立出 Series 與 DataFrame
- Part2. 請上「政府資料開放平臺」，找到感興趣的資料集（限定檔案格式要 CSV 檔或是 Excel 檔），並匯入至 Python，進一步使用 .loc、.iloc 挑選出特定的資料

政府資料開放平臺：https://data.gov.tw/

In [2]:
import numpy as np
import pandas as pd

## Part1. 請按照下方程式碼提示，建立出 Series 與 DataFrame

In [3]:
a_list = [53, 12, 50, 39, 28, 59]

""" 請使用 a_list 建立 Series """
a_list_series = pd.Series(a_list)
a_list_series

0    53
1    12
2    50
3    39
4    28
5    59
dtype: int64

In [4]:
a_2D_list = [[14, 23, 36],
             [41, 51, 64],
             [77, 83, 93]]
column_name_list = ["Column_A", "Column_B", "Column_C"]
index_list = ["Andy", "Tom", "Amy"]

""" 請使用 a_2D_list 建立 DataFrame，並分別使用 index_list、column_name_list 定義 Index 與 Column Name"""
a_2D_list_df = pd.DataFrame(a_2D_list, columns = column_name_list, index = index_list)
a_2D_list_df

      Column_A  Column_B  Column_C
Andy        14        23        36
Tom         41        51        64
Amy         77        83        93

## Part2. 請上「政府資料開放平臺」，找到感興趣的資料集（限定檔案格式要 CSV 檔或是 Excel 檔），並匯入至 Python，進一步使用 .loc、.iloc 挑選出特定的資料

In [5]:
""" 請匯入 CSV 檔案或是 Excel 檔案 """
import pandas as pd

# 路徑
file_path = r"D:\Github\ML100Days\train.csv"
#讀取
df = pd.read_csv(file_path)
df.head(5)

,id,annual_income,debt_to_income_ratio,credit_score,loan_amount,interest_rate,gender,marital_status,education_level,employment_status,loan_purpose,grade_subgrade,loan_paid_back
0,0,29367.99,0.084,736,2528.42,13.67,Female,Single,High School,Self-employed,Other,C3,1.0
1,1,22108.02,0.166,636,4593.10,12.92,Male,Married,Master's,Employed,Debt consolidation,D3,0.0
2,2,49566.20,0.097,694,17005.15,9.76,Male,Single,High School,Employed,Debt consolidation,C5,1.0
3,3,46858.25,0.065,533,4682.48,16.10,Female,Single,High School,Employed,Debt consolidation,F1,1.0
4,4,25496.70,0.053,665,12184.43,10.21,Male,Married,High School,Employed,Other,D1,1.0

In [6]:
""" 請使用 .loc 挑選出三組感興趣的資料，並詳細說明對哪三組資料感興趣"""
# 新增一個欄位「income_to_loan_ratio」 = 年收入 / 貸款金額
# 如果這個比值越高，代表收入相對於貸款金額越充足，還款能力強。
# 如果這個比值越低，代表借得多但收入低，風險高。
df["income_to_loan_ratio"] = df["annual_income"] / df["loan_amount"]

# 找出高收入且利率高，但仍成功還款的前 3 筆
interesting_loc = df.loc[
    (df["annual_income"] > df["annual_income"].mean()) &
    (df["interest_rate"] > df["interest_rate"].mean()) &
    (df["loan_paid_back"] == 1)
].sort_values(by="interest_rate", ascending=False).head(3)

interesting_loc

,id,annual_income,debt_to_income_ratio,credit_score,loan_amount,interest_rate,gender,marital_status,education_level,employment_status,loan_purpose,grade_subgrade,loan_paid_back,income_to_loan_ratio
24465,24465,54427.48,0.063,677,25658.68,20.84,Male,Single,High School,Employed,Business,C2,1.0,2.121211
581371,581371,52453.31,0.087,495,17696.72,20.66,Male,Married,Bachelor's,Employed,Car,F3,1.0,2.964013
224438,224438,53598.51,0.093,535,12350.37,20.64,Female,Married,Master's,Employed,Debt consolidation,F3,1.0,4.339830

In [7]:
""" 請使用 .iloc 挑選出三組感興趣的資料，並詳細說明對哪三組資料感興趣"""
# 按信用分數從低到高排序
data_sorted = df.sort_values(by="credit_score", ascending=True)

# 用 iloc 選出前 3 筆（最低信用分數者）
interesting_iloc = data_sorted.iloc[0:3]

interesting_iloc

#1️⃣ 這三筆資料代表「信用評分最低」的借款人，→ 可以分析這些人是否確實無法還款（loan_paid_back == 0），→ 以驗證信用分數是否真能反映違約風險。
#2️⃣ 若這些人中仍有人成功還款，可能說明信用評分模型需調整。
#3️⃣ 可觀察他們的收入、負債比、職業是否偏離一般違約族群。

,id,annual_income,debt_to_income_ratio,credit_score,loan_amount,interest_rate,gender,marital_status,education_level,employment_status,loan_purpose,grade_subgrade,loan_paid_back,income_to_loan_ratio
81412,81412,41507.38,0.037,395,19130.11,13.18,Female,Single,Other,Employed,Debt consolidation,F2,0.0,2.169741
190625,190625,64718.54,0.082,395,20652.35,16.19,Female,Married,Master's,Employed,Debt consolidation,F4,1.0,3.133713
43281,43281,40562.00,0.195,431,25261.00,15.62,Female,Single,Bachelor's,Employed,Debt consolidation,F4,0.0,1.605716